var COLORS = ["cyan", "yellow", "green", "red", "blue", "orange", "magenta", 
              "gold", "yellowgreen", "olivedrab", "lawngreen", "lime", "aquamarine", "deeppink", 
              "turquoise", "yellow", "midnightblue", "purple"];

var MINOS = [
  [
    [0, 1, 1, 0, 0],
    [0, 0, 1, 1, 0],
    [0, 0, 1, 0, 0] // F ペントミノ
  ],
  [
    [0, 1, 1, 1, 1],
    [0, 1, 0, 0, 0],
    [0, 0, 0, 0, 0] // L ペントミノ
  ],
  [
    [0, 1, 1, 0, 0],
    [0, 0, 1, 1, 1],
    [0, 0, 0, 0, 0] // N ペントミノ
  ],
  [
    [0, 1, 1, 1, 0],
    [0, 0, 1, 1, 0],
    [0, 0, 0, 0, 0] // P ペントミノ
  ],
  [
    [1, 1, 1, 1, 0],
    [0, 0, 1, 0, 0],
    [0, 0, 0, 0, 0] // Y ペントミノ
  ],
  [
    [0, 1, 0, 0, 0],
    [0, 1, 1, 1, 0],
    [0, 0, 0, 1, 0] // Z ペントミノ
  ],
  [
    [0, 0, 1, 1, 0],
    [0, 1, 1, 0, 0],
    [0, 0, 1, 0, 0] // F ペントミノ
  ],
  [
    [0, 1, 1, 1, 1],
    [0, 0, 0, 0, 1],
    [0, 0, 0, 0, 0] // L ペントミノ
  ],
  [
    [0, 0, 1, 1, 1],
    [0, 1, 1, 0, 0],
    [0, 0, 0, 0, 0] // N ペントミノ
  ],
  [
    [0, 1, 1, 1, 0],
    [0, 1, 1, 0, 0],
    [0, 0, 0, 0, 0] // P ペントミノ
  ],
  [
    [1, 1, 1, 1, 0],
    [0, 1, 0, 0, 0],
    [0, 0, 0, 0, 0] // Y ペントミノ
  ],
  [
    [0, 0, 0, 1, 0],
    [0, 1, 1, 1, 0],
    [0, 1, 0, 0, 0] // Z ペントミノ
  ],
  [
    [0, 1, 0, 0, 0],
    [0, 1, 1, 1, 0],
    [0, 1, 0, 0, 0] // T ペントミノ
  ],
  [
    [0, 1, 0, 1, 0],
    [0, 1, 1, 1, 0],
    [0, 0, 0, 0, 0] // U ペントミノ
  ],
  [
    [0, 1, 1, 1, 0],
    [0, 1, 0, 0, 0],
    [0, 1, 0, 0, 0] // V ペントミノ
  ],
  [
    [0, 1, 0, 0, 0],
    [0, 1, 1, 0, 0],
    [0, 0, 1, 1, 0] // W ペントミノ
  ],
  [
    [1, 1, 1, 1, 1],
    [0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0] // I ペントミノ
  ],
  [
    [0, 0, 1, 0, 0],
    [0, 1, 1, 1, 0],
    [0, 0, 1, 0, 0] // X ペントミノ
  ]
];

function newMino() {
  var id = Math.floor(Math.random() * MINOS.length);
  var mino = [];
  for (var y = 0; y < 5; y++) {
    mino[y] = [];
    for (var x = 0; x < 5; x++) {
      mino[y][x] = 0;
      if (MINOS[id][y]) {
        if (MINOS[id][y][x]) {
          mino[y][x] = id + 1;
        }
      }
    }
  }
  return mino;
}
 
function rotate(mino) {
  var rotated = [];
  for (var y = 0; y < 5; ++y) {
    rotated[y] = [];
    for (var x = 0; x < 5; ++x) {
      rotated[y][x] = mino[x][- y + 4];
    }
  }
  return rotated;
}